//运行逻辑





//执行机构**************
//delta机构

//需要传入三维坐标（delta的坐标系，也可以进行坐标变换）
//分为击球状态和待定状态，待定状态为机械臂水平，击球状态为接收到三维坐标后进行击球动作
//delta依托丝杆机构进行俯仰变换，因此delta坐标系需要对世界坐标系进行坐标变换
//丝杆机构执行离散角度的实现



//
//
//
//
//
//
//
//





//小米电机
//需要调节电机的转速实现击球位置的改变
//
//
//
//
//
//气缸机构
//
//
//
//
//



//底盘

//***********************

//通信关系****************
//
//
//

//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//